data/Parm_PH_29/alpha_05/alpha_05_7071_3036/0/C
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
15600
(
(0.0335640030431361 1.00164986936672 8.06411209399309e-18)
(0.0995012393359851 0.992996132886476 -4.1654459029935e-18)
(0.158463017038255 0.964297616495446 0)
(0.206296113447069 0.91798682558059 -2.05307819819271e-18)
(0.246249606323682 0.864157129563122 0)
(0.282438842097105 0.807677432854663 1.01216904168655e-17)
(0.316886912155085 0.75013456068266 -6.02678688643528e-18)
(0.35085475244742 0.692317502785337 1.81046740334998e-18)
...
)
;

boundaryField
{
    bottomWall
    {
        type            calculated;
        value           nonuniform List<vector> 
120
(
(0.0335690275286261 0.999693889251279 0)
(0.0994414107947632 0.991044162718845 0)
(0.15829093079975 0.962415977054515 0)
(0.206060430486753 0.916154029707829 0)
(0.245977171101906 0.862280929909244 0)
(0.282133757651782 0.805706042379331 0)
(0.31654837277333 0.748040667220008 0)
(0.350481693151915 0.690085035558101 0)
...
)
;
    }
    topWall
    {
        type            calculated;
        value           nonuniform List<vector> 
120
(
(0.0294625 3.036 0)
(0.0883875 3.036 0)
(0.1473125 3.036 0)
(0.2062375 3.036 0)
(0.2651625 3.036 0)
(0.3240875 3.036 0)
(0.3830125 3.036 0)
(0.4419375 3.036 0)
...
)
;
    }
    inlet_half0
    {
        type            cyclic;
    }
    inlet_half1
    {
        type            cyclic;
    }
    outlet_half0
    {
        type            cyclic;
    }
    outlet_half1
    {
        type            cyclic;
    }
    sideRight_half0
    {
        type            empty;
    }
    sideRight_half1
    {
        type            empty;
    }
    sideLeft_half0
    {
        type            empty;
    }
    sideLeft_half1
    {
        type            empty;
    }
}


// ************************************************************************* //
