data/Parm_PH_29/alpha_05/alpha_05_7071_3036/0/tauij_LES
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "0";
    object      tauij_LES;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<symmTensor>
15600
(
(0.00488137 -0.00004601 0.00000000 0.00000972 0.00000000 0.00402915)
(-0.00009865 -0.00034637 0.00000000 0.00034678 0.00000000 0.00181084)
(-0.00006597 -0.00000221 0.00000000 -0.00017301 0.00000000 -0.00018086)
(0.00001026 -0.00014430 0.00000000 0.00034345 0.00000000 0.00097963)
(0.00004790 -0.00008955 0.00000000 0.00016596 0.00000000 0.00048442)
(0.00001352 -0.00001990 0.00000000 0.00003081 0.00000000 0.00042037)
(0.00002898 -0.00001628 0.00000000 -0.00001178 0.00000000 0.00031310)
(0.00000991 0.00001226 0.00000000 -0.00005099 0.00000000 0.00023604)
...
)
;

boundaryField
{
    bottomWall
    {
        type        fixedValue;
        value       uniform (0 0 0 0 0 0);
    }
    topWall
    {
        type        fixedValue;
        value       uniform (0 0 0 0 0 0);
    }
    inlet_half0
    {
        type        cyclic;
    }
    inlet_half1
    {
        type        cyclic;
    }
    outlet_half0
    {
        type        cyclic;
    }
    outlet_half1
    {
        type        cyclic;
    }
    sideRight_half0
    {
        type        empty;
    }
    sideRight_half1
    {
        type        empty;
    }
    sideLeft_half0
    {
        type        empty;
    }
    sideLeft_half1
    {
        type        empty;
    }
}

// ************************************************************************* //
